-- 1. Сначала добавляем новые филиалы
INSERT INTO branches (id, name) VALUES 
(6100, 'Операционный депортамент'),
(5100, 'Филиал Садбарг'),
(5111, 'ЦБО Корвон'),
(5200, 'Филиал Худжанд'),
(5300, 'Филиал Бохтар'),
(5400, 'Филиал Вахдат'),
(5500, 'Филиал Турсунзода'),
(5800, 'Филиал Куляба'),
(5204, 'ЦБО Худжанд'),
(5401, 'ЦБО Вахдат'),
(5600, 'ЦБО Шахринав'),
(5700, 'ЦБО Хиссор'),
(6000, 'ЦБО Кубодиён'),
(6200, 'ЦБО Восеъ'),
(6300, 'ЦБО Шахритуз'),
(6400, 'ЦБО Панчакент'),
(6500, 'ЦБО Чайхун'),
(6600, 'ЦБО н.И. Сомони ш. Душанде'),
(6700, 'ЦБО Файзобод'),
(6800, 'ЦБО Дангара')
ON CONFLICT (id) DO UPDATE SET name = EXCLUDED.name;

UPDATE contracts SET branch_id = 6100 WHERE branch_id < 100;
UPDATE counterparties SET branch_id = 6100 WHERE branch_id < 100;

-- 3. Теперь можно безопасно удалить старые тестовые филиалы
DELETE FROM branches WHERE id < 100;